In [20]:
# Print a message to guide the user
# Import MySQL Connector/Python
print("Importing MySQL Connector/Python API")
import mysql.connector as connector
print("MySQL Connector/Python API is imported successfully.\n")
from mysql.connector.pooling import MySQLConnectionPool, Error

Importing MySQL Connector/Python API
MySQL Connector/Python API is imported successfully.

In [21]:
# Establis connection with authorized user/password
print("Establishing a new connection between MySQL and Python.")
#connection=connector.connect(user="your_username",password="your_password")

dbconfig = {
    "database":"littlelemonfinaldb",
    "user" : "root",
    "password" : "159159Az!"
}

try:
    pool = MySQLConnectionPool(pool_name = "ll_pool_a",
                           pool_size = 3, #default is 5
                           **dbconfig)
    print("The connection pool is created with a name: ",pool.pool_name)
    print("The pool size is:",pool.pool_size)

except Error as er:
    print("Error code:", er.errno)
    print("Error message:", er.msg)

# Get the connection from the connection pool "pool"
print("Getting a connection from the pool.")
connection = pool.get_connection()

print("A user with connection id {} is connected to the database.".format(
    connection.connection_id))

db_Info = connection.get_server_info()
print("MySQL server version is:", db_Info)

Establishing a new connection between MySQL and Python.
The connection pool is created with a name:  ll_pool_a
The pool size is: 3
Getting a connection from the pool.
A user with connection id 181 is connected to the database.
MySQL server version is: 8.0.32

In [22]:
# Create cursor object to communicate with entire MySQL database
print("Creating a cursor object.")
cursor = connection.cursor()

Creating a cursor object.

In [23]:
print("Selecting database.")
cursor.execute("USE littlelemonfinaldb")

Selecting database.

In [24]:
#*******************************************************#
# Insert query to populate "MenuItems" table:
#*******************************************************#
#Using INSERT IGNORE, so no fun stuff happen.
insert_menuitems="""
INSERT IGNORE INTO MenuItems (ItemID, CourseName, StarterName, DesertName)
VALUES
(1, 'Salmon', 'Caesar Salad', 'Cheesecake'),
(2, 'Beef Wellington', 'Caprese Salad', 'Chocolate Mousse'),
(3, 'Lobster Bisque', 'Tuna Tartare', 'Crème Brûlée'),
(4, 'Mushroom Risotto', 'Minestrone Soup', 'Tiramisu'),
(5, 'Chicken Marsala', 'Bruschetta', 'Panna Cotta'),
(6, 'Shrimp Scampi', 'House Salad', 'Gelato'),
(7, 'Filet Mignon', 'French Onion Soup', 'Chocolate Fondant'),
(8, 'Grilled Octopus', 'Greek Salad', 'Baklava'),
(9, 'Lamb Chops', 'Hummus', 'Turkish Delight'),
(10, 'Veal Parmesan', 'Antipasti Platter', 'Cannoli'),
(11, 'Sushi Platter', 'Miso Soup', 'Green Tea Ice Cream'),
(12, 'Crab Cakes', 'Seafood Chowder', 'Key Lime Pie'),
(13, 'Pork Tenderloin', 'Arugula Salad', 'Chocolate Cake'),
(14, 'Vegetable Curry', 'Naan Bread', 'Mango Sorbet');
"""

print("Inserting data in MenuItems table.")
# Populate MenuItems table
cursor.execute(insert_menuitems)
print("Total number of rows modifieds/inserted by this query: ", cursor.rowcount)
# Once the query is executed, you commit the change into the database 
connection.commit()

# Cheking if everthing is allright.
show_menu="""SELECT * FROM MenuItems"""
cursor.execute(show_menu)
# Retrieve the column names
cols = cursor.column_names
# Printing columns
print(cols)
# Printing the table
result = cursor.fetchall()
for results in result:
    print(results)

Inserting data in MenuItems table.
Total number of rows modifieds/inserted by this query:  0
('ItemID', 'CourseName', 'StarterName', 'DesertName')
(1, 'Salmon', 'Caesar Salad', 'Cheesecake')
(2, 'Beef Wellington', 'Caprese Salad', 'Chocolate Mousse')
(3, 'Lobster Bisque', 'Tuna Tartare', 'Crème Brûlée')
(4, 'Mushroom Risotto', 'Minestrone Soup', 'Tiramisu')
(5, 'Chicken Marsala', 'Bruschetta', 'Panna Cotta')
(6, 'Shrimp Scampi', 'House Salad', 'Gelato')
(7, 'Filet Mignon', 'French Onion Soup', 'Chocolate Fondant')
(8, 'Grilled Octopus', 'Greek Salad', 'Baklava')
(9, 'Lamb Chops', 'Hummus', 'Turkish Delight')
(10, 'Veal Parmesan', 'Antipasti Platter', 'Cannoli')
(11, 'Sushi Platter', 'Miso Soup', 'Green Tea Ice Cream')
(12, 'Crab Cakes', 'Seafood Chowder', 'Key Lime Pie')
(13, 'Pork Tenderloin', 'Arugula Salad', 'Chocolate Cake')
(14, 'Vegetable Curry', 'Naan Bread', 'Mango Sorbet')

In [25]:
#*******************************************************#
# Insert query to populate "Menu" table:
#*******************************************************#
insert_menus="""
INSERT IGNORE INTO Menus (MenuID, ItemID, MenuName, Cuisine)
VALUES
(1, 1, 'Pacific Catch', 'Seafood'),
(2, 2, 'English Countryside', 'British'),
(3, 3, 'New England Feast', 'American'),
(4, 4, 'Italian Delight', 'Italian'),
(5, 5, 'Mediterranean Nights', 'Mediterranean'),
(6, 6, 'Coastal Bliss', 'Seafood'),
(7, 7, 'Classic Steakhouse', 'American'),
(8, 8, 'Greek Isles', 'Greek'),
(9, 9, 'Middle Eastern Journey', 'Middle Eastern'),
(10, 10, 'Italian Feast', 'Italian'),
(11, 11, 'Sushi Night', 'Japanese'),
(12, 12, 'East Coast Seafood', 'Seafood'),
(13, 13, 'Taste of the South', 'American'),
(14, 14, 'Vegetarian Delight', 'Vegetarian');"""

print("Inserting data in Menus table.")
# Populate Menus table
cursor.execute(insert_menus)
print("Total number of rows modifieds/inserted by this query: ", cursor.rowcount)
# Once the query is executed, you commit the change into the database 
connection.commit()

# Cheking if everthing is allright.
show_menus="""SELECT * FROM Menus"""
cursor.execute(show_menus)
# Retrieve the column names
cols = cursor.column_names
# Printing columns
print(cols)
# Printing the table
result = cursor.fetchall()
for results in result:
    print(results)

Inserting data in Menus table.
Total number of rows modifieds/inserted by this query:  0
('MenuID', 'ItemID', 'MenuName', 'Cuisine')
(1, 1, 'Pacific Catch', 'Seafood')
(2, 2, 'English Countryside', 'British')
(3, 3, 'New England Feast', 'American')
(4, 4, 'Italian Delight', 'Italian')
(5, 5, 'Mediterranean Nights', 'Mediterranean')
(6, 6, 'Coastal Bliss', 'Seafood')
(7, 7, 'Classic Steakhouse', 'American')
(8, 8, 'Greek Isles', 'Greek')
(9, 9, 'Middle Eastern Journey', 'Middle Eastern')
(10, 10, 'Italian Feast', 'Italian')
(11, 11, 'Sushi Night', 'Japanese')
(12, 12, 'East Coast Seafood', 'Seafood')
(13, 13, 'Taste of the South', 'American')
(14, 14, 'Vegetarian Delight', 'Vegetarian')

In [26]:
#*******************************************************#
# Insert query to populate "Customers" table:
#*******************************************************#
insert_customers="""
INSERT IGNORE INTO Customers (CustomersID, GuestFirstName, GuestLastName, Email, PhoneNumber)
VALUES
(1, 'Anna','Iversen','Anna.Iv@Livmail.com',984253698),
(2, 'John', 'Doe', 'johndoe@example.com', 123456789),
(3, 'Jane', 'Doe', 'janedoe@example.com', 234567890),
(4, 'Alice', 'Smith', 'alicesmith@example.com', 345678901),
(5, 'Bob', 'Smith', 'bobsmith@example.com', 456789012),
(6, 'David', 'Lee', 'davidlee@example.com', 567890123),
(7, 'Sarah', 'Kim', 'sarahkim@example.com', 678901234),
(8, 'James', 'Johnson', 'jamesjohnson@example.com', 789012345),
(9, 'Emily', 'Davis', 'emilydavis@example.com', 890123456),
(10, 'William', 'Brown', 'williambrown@example.com', 901234567),
(11, 'Olivia', 'Taylor', 'oliviataylor@example.com', 123456789),
(12, 'Michael', 'Miller', 'michaelmiller@example.com', 234567890);"""

print("Inserting data in Customers table.")
# Populate Customers table
cursor.execute(insert_customers)
print("Total number of rows modifieds/inserted by this query: ", cursor.rowcount)
# Once the query is executed, you commit the change into the database 
connection.commit()

# Cheking if everthing is allright.
show_Customers="""SELECT * FROM Customers"""
cursor.execute(show_Customers)
# Retrieve the column names
cols = cursor.column_names
# Printing columns
print(cols)
# Printing the table
result = cursor.fetchall()
for results in result:
    print(results)

Inserting data in Customers table.
Total number of rows modifieds/inserted by this query:  0
('CustomersID', 'GuestFirstName', 'GuestLastName', 'Email', 'PhoneNumber')
(1, 'Anna', 'Iversen', 'Anna.Iv@Livmail.com', 984253698)
(2, 'John', 'Doe', 'johndoe@example.com', 123456789)
(3, 'Jane', 'Doe', 'janedoe@example.com', 234567890)
(4, 'Alice', 'Smith', 'alicesmith@example.com', 345678901)
(5, 'Bob', 'Smith', 'bobsmith@example.com', 456789012)
(6, 'David', 'Lee', 'davidlee@example.com', 567890123)
(7, 'Sarah', 'Kim', 'sarahkim@example.com', 678901234)
(8, 'James', 'Johnson', 'jamesjohnson@example.com', 789012345)
(9, 'Emily', 'Davis', 'emilydavis@example.com', 890123456)
(10, 'William', 'Brown', 'williambrown@example.com', 901234567)
(11, 'Olivia', 'Taylor', 'oliviataylor@example.com', 123456789)
(12, 'Michael', 'Miller', 'michaelmiller@example.com', 234567890)

In [28]:
#*******************************************************#
# Insert query to populate "Bookings" table:
#*******************************************************#
insert_bookings="""
INSERT IGNORE INTO Bookings (BookingID, BookingSlot, EmployeeID, CustomersID, DeliveryID, OrderID, TableNO, BookingDate)
VALUES
(1, '19:00:00', 5, 9, 1, 1, 1, 2022-10-15),
(2, '19:00:00', 8, 4, 2, 2, 2, 2022-10-15),
(3, '15:00:00', 7, 8, 3, 5, 3, 2022-10-15),
(4, '17:30:00', 7, 12, 4, 8, 4, 2022-10-15),
(5, '18:30:00', 5, 7, 5, 3, 5, 2022-10-15),
(6, '20:00:00', 8, 2, 6, 4, 6, 2022-10-15),
(7, '18:00:00', 5, 7, 7, 6, 5, 2022-10-10),
(8, '18:00:00', 5, 3, 8, 7, 3, 2022-10-12),
(9, '17:00:00', 5, 9, 9, 9, 2, 2022-10-11),
(10, '19:00:00', 5, 11, 10, 10, 2, 2022-10-13);"""

print("Inserting data in Bookings table.")
# Populate Bookings table
cursor.execute(insert_bookings)
print("Total number of rows modifieds/inserted by this query: ", cursor.rowcount)
# Once the query is executed, you commit the change into the database 
connection.commit()

# Cheking if everthing is allright.
show_bookings="""SELECT * FROM Bookings"""
cursor.execute(show_bookings)
# Retrieve the column names
cols = cursor.column_names
# Printing columns
print(cols)
# Printing the table
result = cursor.fetchall()
for results in result:
    print(results)

Inserting data in Bookings table.
Total number of rows modifieds/inserted by this query:  0
('BookingID', 'BookingSlot', 'EmployeeID', 'CustomersID', 'DeliveryID', 'OrderID', 'TableNO', 'BookingDate')
(1, datetime.timedelta(seconds=68400), 5, 9, 1, 1, 4, datetime.date(2022, 10, 15))
(2, datetime.timedelta(seconds=68400), 8, 4, 2, 2, 2, datetime.date(2022, 10, 15))
(3, datetime.timedelta(seconds=54000), 7, 8, 3, 5, 1, datetime.date(2022, 10, 15))
(4, datetime.timedelta(seconds=63000), 7, 12, 4, 8, 3, datetime.date(2022, 10, 15))
(5, datetime.timedelta(seconds=66600), 5, 7, 5, 3, 1, datetime.date(2022, 10, 15))
(6, datetime.timedelta(seconds=72000), 8, 2, 6, 4, 3, datetime.date(2022, 10, 15))
(7, datetime.timedelta(seconds=64800), 5, 7, 7, 6, 5, None)
(8, datetime.timedelta(seconds=64800), 5, 3, 8, 7, 3, None)
(9, datetime.timedelta(seconds=61200), 5, 9, 9, 9, 2, None)
(10, datetime.timedelta(seconds=68400), 5, 11, 10, 10, 2, None)

In [16]:
#*******************************************************#
# Insert query to populate "DeliveryStatus" table:
#*******************************************************#
insert_DeliveryStatus="""
INSERT IGNORE INTO deliverystatus (DeliveryID, Status, Date)
VALUES
(1, 'Being prepared', '2022-10-15'),
(2, 'Being prepared', '2022-10-15'),
(3, 'Delivered', '2022-10-15'),
(4, 'Delivered', '2022-10-15'),
(5, 'Delivered', '2022-10-15'),
(6, 'Waiting in line', '2022-10-15'),
(7, 'Delivered', '2022-10-10'),
(8, 'Delivered', '2022-10-12'),
(9, 'Delivered', '2022-10-11'),
(10, 'Delivered', '2022-10-13');"""

print("Inserting data in DeliveryStatus table.")
# Populate DeliveryStatus table
cursor.execute(insert_DeliveryStatus)
print("Total number of rows modifieds/inserted by this query: ", cursor.rowcount)
# Once the query is executed, you commit the change into the database 
connection.commit()

# Cheking if everthing is allright.
show_deliverystatus="""SELECT * FROM deliverystatus"""
cursor.execute(show_deliverystatus)
# Retrieve the column names
cols = cursor.column_names
# Printing columns
print(cols)
# Printing the table
result = cursor.fetchall()
for results in result:
    print(results)

Inserting data in DeliveryStatus table.
Total number of rows modifieds/inserted by this query:  4
('DeliveryID', 'Status', 'Date')
(1, 'Being prepared', datetime.date(2023, 4, 4))
(2, 'Being prepared', datetime.date(2023, 4, 4))
(3, 'Delivered', datetime.date(2023, 4, 4))
(4, 'Delivered', datetime.date(2023, 4, 4))
(5, 'Delivered', datetime.date(2023, 4, 4))
(6, 'Waiting in line', datetime.date(2023, 4, 4))
(7, 'Delivered', datetime.date(2022, 10, 10))
(8, 'Delivered', datetime.date(2022, 10, 12))
(9, 'Delivered', datetime.date(2022, 10, 11))
(10, 'Delivered', datetime.date(2022, 10, 13))

In [17]:
#*******************************************************#
# Insert query to populate "Orders" table:
#*******************************************************#
insert_orders="""
INSERT IGNORE INTO Orders (OrderID, MenuID, BillAmount, Quantity)
VALUES
(1, 12, 25, 1),
(2, 7, 40, 2),
(3, 5, 30, 1),
(4, 3, 225, 1),
(5, 8, 45, 2),
(6, 2, 15, 1),
(7, 6, 35, 1),
(8, 4, 175, 1),
(9, 11, 50, 3),
(10, 9, 25, 1),
(11, 1, 60, 2),
(12, 10, 40, 2);"""

print("Inserting data in Orders table.")
# Populate Bookings table
cursor.execute(insert_orders)
print("Total number of rows modifieds/inserted by this query: ", cursor.rowcount)
# Once the query is executed, you commit the change into the database 
connection.commit()

# Cheking if everthing is allright.
show_orders="""SELECT * FROM Orders"""
cursor.execute(show_orders)
# Retrieve the column names
cols = cursor.column_names
# Printing columns
print(cols)
# Printing the table
result = cursor.fetchall()
for results in result:
    print(results)

Inserting data in Orders table.
Total number of rows modifieds/inserted by this query:  0
('OrderID', 'MenuID', 'BillAmount', 'Quantity', 'BookingID')
(1, 12, Decimal('25.00'), 1, 1)
(2, 7, Decimal('40.00'), 2, 2)
(3, 5, Decimal('30.00'), 1, 3)
(4, 3, Decimal('225.00'), 1, 4)
(5, 8, Decimal('45.00'), 2, 5)
(6, 2, Decimal('15.00'), 1, 6)
(7, 6, Decimal('35.00'), 1, 1)
(8, 4, Decimal('175.00'), 1, 2)
(9, 11, Decimal('50.00'), 3, 3)
(10, 9, Decimal('25.00'), 1, 4)
(11, 1, Decimal('60.00'), 2, 5)
(12, 10, Decimal('40.00'), 2, 6)

In [18]:
#*******************************************************#
# Insert query to populate "Employees" table:
#*******************************************************#
insert_employees = """
INSERT IGNORE INTO employees (EmployeeID, Name, Role, Address, Contact_Number, Email, Annual_Salary)
VALUES
(1,'Mario Gollini','Manager','724, Parsley Lane, Old Town, Chicago, IL',351258074,'Mario.g@littlelemon.com','$70,000'),
(2,'Adrian Gollini','Assistant Manager','334, Dill Square, Lincoln Park, Chicago, IL',351474048,'Adrian.g@littlelemon.com','$65,000'),
(3,'Giorgos Dioudis','Head Chef','879 Sage Street, West Loop, Chicago, IL',351970582,'Giorgos.d@littlelemon.com','$50,000'),
(4,'Fatma Kaya','Assistant Chef','132 Bay Lane, Chicago, IL',351963569,'Fatma.k@littlelemon.com','$45,000'),
(5,'Elena Salvai','Head Waiter','989 Thyme Square, EdgeWater, Chicago, IL',351074198,'Elena.s@littlelemon.com','$40,000'),
(6,'John Millar','Receptionist','245 Dill Square, Lincoln Park, Chicago, IL',351584508,'John.m@littlelemon.com','$35,000'),
(7,'Tom Smith','Waiter','111 Olive Ave, Lakeview, Chicago, IL',351753951,'Tom.s@littlelemon.com','$30,000'),
(8,'Linda Brown','Waiter','432 Cherry St, River North, Chicago, IL',351852369,'Linda.b@littlelemon.com','$30,000');
"""
print("Created insert variable.")

print("Inserting data in Employees table.")
# Populate Employees table
cursor.execute(insert_employees)
print("Total number of rows modifieds/inserted by this query: ", cursor.rowcount)
# Once the query is executed, you commit the change into the database 
connection.commit()

# Cheking if everthing is allright.
show_Employees="""SELECT * FROM Employees"""
cursor.execute(show_Employees)
# Retrieve the column names
cols = cursor.column_names
# Printing columns
print(cols)
# Printing the table
result = cursor.fetchall()
for results in result:
    print(results)

Created insert variable.
Inserting data in Employees table.
Total number of rows modifieds/inserted by this query:  0
('EmployeeID', 'Name', 'Role', 'Address', 'Contact_Number', 'Email', 'Annual_Salary')
(1, 'Mario Gollini', 'Manager', '724, Parsley Lane, Old Town, Chicago, IL', 351258074, 'Mario.g@littlelemon.com', '$70,000')
(2, 'Adrian Gollini', 'Assistant Manager', '334, Dill Square, Lincoln Park, Chicago, IL', 351474048, 'Adrian.g@littlelemon.com', '$65,000')
(3, 'Giorgos Dioudis', 'Head Chef', '879 Sage Street, West Loop, Chicago, IL', 351970582, 'Giorgos.d@littlelemon.com', '$50,000')
(4, 'Fatma Kaya', 'Assistant Chef', '132 Bay Lane, Chicago, IL', 351963569, 'Fatma.k@littlelemon.com', '$45,000')
(5, 'Elena Salvai', 'Head Waiter', '989 Thyme Square, EdgeWater, Chicago, IL', 351074198, 'Elena.s@littlelemon.com', '$40,000')
(6, 'John Millar', 'Receptionist', '245 Dill Square, Lincoln Park, Chicago, IL', 351584508, 'John.m@littlelemon.com', '$35,000')
(7, 'Tom Smith', 'Waiter', '111 Olive Ave, Lakeview, Chicago, IL', 351753951, 'Tom.s@littlelemon.com', '$30,000')
(8, 'Linda Brown', 'Waiter', '432 Cherry St, River North, Chicago, IL', 351852369, 'Linda.b@littlelemon.com', '$30,000')

In [29]:
# Let's close the cursor and the connection
if connection.is_connected():
    cursor.close()
    print("The cursor is closed.")
    connection.close()
    print("MySQL connection is closed.")
else:
    print("Connection is already closed")
    cursor.close()

The cursor is closed.
MySQL connection is closed.

In [ ]:
USE littlelemonfinaldb;
SELECT customers.CustomersID, CONCAT(customers.GuestFirstName, ' ', customers.GuestLastName) AS FullName, orders.OrderID AS "Order ID", orders.BillAmount, menus.MenuName, menuitems.CourseName, menuitems.StarterName
FROM customers
JOIN bookings ON bookings.CustomersID = customers.CustomersID
RIGHT JOIN orders ON orders.OrderID = bookings.OrderID
LEFT JOIN menus ON menus.MenuID = orders.MenuID
LEFT JOIN menuitems ON menuitems.ItemID = menus.ItemID
WHERE orders.BillAmount > 150
ORDER BY orders.BillAmount ASC;